In [114]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"] = (20,10)

In [115]:
df1=pd.read_csv("E:\Data\Bengaluru_House_Data.csv")

In [116]:
df1.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [117]:
df1.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

In [118]:
df1.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [119]:
df2=df1.drop(["area_type","society","balcony","availability"],axis='columns')
df2.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [120]:
df2['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', nan, '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [121]:
size=df2['size'].str.split(" ", n = 1, expand = True)  
df2['BHK']=size[0]

In [122]:
df2.head()

                   location       size total_sqft  bath   price BHK
0  Electronic City Phase II      2 BHK       1056   2.0   39.07   2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00   4
2               Uttarahalli      3 BHK       1440   2.0   62.00   3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00   3
4                  Kothanur      2 BHK       1200   2.0   51.00   2

In [123]:
df3=df2.drop(["size"],axis=1)
df3.head()

                   location total_sqft  bath   price BHK
0  Electronic City Phase II       1056   2.0   39.07   2
1          Chikka Tirupathi       2600   5.0  120.00   4
2               Uttarahalli       1440   2.0   62.00   3
3        Lingadheeranahalli       1521   3.0   95.00   3
4                  Kothanur       1200   2.0   51.00   2

In [124]:
df3['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [125]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [128]:
df3[~df3['total_sqft'].apply(is_float)]

                 location   total_sqft  bath    price BHK
30              Yelahanka  2100 - 2850   4.0  186.000   4
56            Devanahalli  3010 - 3410   NaN  192.000   4
81            Hennur Road  2957 - 3450   NaN  224.500   4
122                Hebbal  3067 - 8156   4.0  477.000   4
137    8th Phase JP Nagar  1042 - 1105   2.0   54.005   2
...                   ...          ...   ...      ...  ..
12990      Talaghattapura  1804 - 2273   3.0  122.000   3
13059              Harlur  1200 - 1470   2.0   72.760   2
13240         Devanahalli  1020 - 1130   NaN   52.570   1
13265               Hoodi  1133 - 1384   2.0   59.135   2
13299          Whitefield  2830 - 2882   5.0  154.500   4

[247 rows x 5 columns]

In [140]:
# col_30=df3['total_sqft'].values[30]
# tokens=col_30.split('-')
# print(tokens)   OUTPUT: ['2100 ', ' 2850']
# print(len(tokens))    OUTPUT: 2

In [108]:
def convert_sqft_to_num(x):
    tokens=x.split('-')
    if len(tokens) == 2:
        return(float(tokens[0])+float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [109]:
df3['total_sqft'] = df3['total_sqft'].apply(convert_sqft_to_num)

In [113]:
df3.head()

                   location  total_sqft  bath   price BHK
0  Electronic City Phase II      1056.0   2.0   39.07   2
1          Chikka Tirupathi      2600.0   5.0  120.00   4
2               Uttarahalli      1440.0   2.0   62.00   3
3        Lingadheeranahalli      1521.0   3.0   95.00   3
4                  Kothanur      1200.0   2.0   51.00   2

In [ ]:
df4["price_per_square_feet"]=df3["price"]